// - Користувач вводить або має два числа. Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.
let a = +prompt("Введіть якесь число 'А'");
let b = +prompt("Введіть число 'Б'");
if (a > b) {
    console.log(`Число ${a} більше від ${b}`);
} else if (a < b) {
    console.log(`Число ${a} менше від ${b}`);
} else {
    console.log(`Число А=${a} рівне числу Б=${b}`);
}

// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90. Користувач вводить номер квартири
// просто в змінні або через prompt(''). Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
let flat = Math.round(prompt("Введіть номер квартири від 1 до 90"));
if (flat <= 20 && flat > 0) {
    console.log(flat + " - ця квартира знаходиться у першому підїзді");
} else if (flat >= 21 && flat <= 48) {
    console.log(flat + " - ця квартира знаходиться у другому підїзді");
} else if (flat >= 49 && flat <= 90) {
    console.log(flat + " - ця квартира знаходиться у третьому підїзді");
} else {
    alert("Ахтунг! Ви живете в іншому будинку )))");
}

// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
let number = +prompt("Введіть якесь число");
number === 10 ? console.log('ВІРНО') : console.log('НЕВІРНО');

// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?". Змінна, яка характеризує температуру.
// Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
// Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
let temperatura = +prompt("Чи ми йдемо сьогодні в OKTEN на навчання? Скільки зараз градусів?");
temperatura >= 10 && temperatura <= 22 ? console.log(`Зараз +${temperatura}^C і ми йдемо ВЧИТИСЯ`) : console.log(`Зараз ${temperatura}^C тому сидимо вдома і вчимося ОНЛАЙН`);

// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .
let luckyNumber = +prompt("Введіть ваше щасливе число від 1 до 5");
switch (luckyNumber){
    case 1:
        console.log("Ви виграли автомобіль!");
        break;
    case 2:
        console.log("Ви виграли мотоцик!");
        break;
    case 3:
        console.log("Ви виграли телефон Nokia 3310");
        break;
    case 4:
        console.log("Ви виграли подорож на Мальдіви!");
        break;
    case 5:
        console.log("Ви виграли квартиру!");
        break;
    default:
        console.log("Число не вірне, або призи закінчились.")
}
